### Problem_1: Create a Pandas Series that contains the folowing data:4,8,15,16,23 and 42. Then, print the series.

In [1]:
import pandas as pd
lst=[4,8,15,16,23,42]
series=pd.Series(lst)
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Problem_2: Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
lst_1=[1,2,3,4,5,6,7,8,9,10]
var_lst=pd.Series(lst_1)
var_lst

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [7]:
type(var_lst)

pandas.core.series.Series

### Problem_3: Create a Pandas DataFrame that contains the data like this.

In [4]:
d={'Name': ['Alice','Bob','Claire'],
   'Age' : [25, 30, 27],
   'Gender': ['Female','Male', 'Female']
}
pd.DataFrame(d)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Problem_4: What is 'DataFrame' in pandas and how it is differnet from pandas.series? EXplain with an example.

### Series:
  - One-dimensional array-like object.
  - Can hold data of a single data type (e.g., integers, strings).
  - Each value in the Series is associated with a label (index).

### DataFrame:
  - Two-dimensional, tabular data structure.
  - Can hold data of various data types in different columns.
  - Similar to a spreadsheet with rows and columns. Each column represents a variable, and each row represents a data point.
  - Rows are labeled with an index (optional).

In [5]:
## Example to demonstrate the Series:
# suppose we have data of grade of students
math_grades=pd.Series([85,75,88,90])
english_grades=pd.Series([70,86,79,91])
science_grades=pd.Series([77,86,89,93])
# Difficult the analyze relationships between grades in different subjects

In [7]:
# Example to demonstrate the DataFrame
data={'math': [85,75,88,90],
      'English': [70,86,79,91],
      'Science': [77,86,89,93]
}
grades_df=pd.DataFrame(data)
grades_df

   math  English  Science
0    85       70       77
1    75       86       86
2    88       79       89
3    90       91       93

### Problem_5: What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

1. Selection:

  - head(): Returns the first n rows of the DataFrame. This is useful for getting a quick glimpse of the initial data.
  - tail(): Returns the last n rows of the DataFrame. Useful for checking for abnormalities at the end.
  - loc[ ]: Selects rows and/or columns using labels. Great for grabbing specific data based on index or column names.
  - iloc[ ]: Selects rows and/or columns using position. Useful for selecting data by integer position.
  - apply(): Applies a function to each element or row/column of the DataFrame. This is versatile for creating new columns or modifying existing ones based on a custom logic.

In [10]:
# Example of head()-- Suppose we have data 
data={'math': [85,75,88,90],
      'English': [70,86,79,91],
      'Science': [77,86,89,93],
      'Computer':[91,95,92,93],
      'Data Structure':[78,83,94,67]
}
grd_df=pd.DataFrame(data)
grd_df.head(2)

   math  English  Science  Computer  Data Structure
0    85       70       77        91              78
1    75       86       86        95              83

### Problem_6: Which of the following is mutable in nature Series, DataFrame, Panel?

### Out of the three Pandas data structures, DataFrame and Panel are mutable in nature.

  - Series: While elements (values) within a Series can be changed, the size of the Series (number of elements) cannot be modified. This means you cannot add or remove elements after creating the Series.

  - DataFrame: DataFrames allow modifications to both elements (values) and size. You can add, remove, or modify rows and columns within a DataFrame.

  - Panel: Similar to DataFrame, Panels are also mutable. You can change element values and also add or remove elements (slices) from the Panel.

### Problem_7: Create a DataFrame using multiple Series. Explain with an example.

In [2]:
# Creating Students data as Series:
name_series=pd.Series(['Alice','Bob','Charlie'])
age_series=pd.Series([15,17,14])
grade_series=pd.Series(['A','B','A'])

# Combining Series data into DataFrame
student_data=pd.DataFrame({
    'Name':name_series,
    'Age':age_series,
    'Grade':grade_series
})
student_data

      Name  Age Grade
0    Alice   15     A
1      Bob   17     B
2  Charlie   14     A